; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v3 ?v13)
             (pred_11 ?v10 ?v11)
             (pred_9 ?v3 ?v11)
             (pred_4 ?v6 ?v3 )
	     (pred_3 ?v3)
             (pred_6 ?v5)
             (pred_2 ?v10)
             (pred_7 ?v11)
             (pred_5 ?v3)
             (pred_10 ?v10)
             (pred_1 ?v3)
             (pred_12 ))



(:action op_5
:parameters (?v9 ?v7 ?v1 ?v8)
:precondition (and (pred_6 ?v9) (pred_6 ?v7) (pred_2 ?v1) (pred_7 ?v8)
          (pred_8 ?v9 ?v7) (pred_11 ?v1 ?v8)
                   (pred_9 ?v7 ?v8) (pred_3 ?v9) 
                   (pred_5 ?v7) (pred_10 ?v1))
:effect (and  (pred_1 ?v7) (not (pred_5 ?v7))))


(:action op_2
:parameters (?v9 ?v4)
:precondition (and (pred_6 ?v9) (pred_6 ?v4)
               (pred_3 ?v9) (pred_8 ?v9 ?v4) (pred_1 ?v4))
:effect (and (pred_3 ?v4) (not (pred_3 ?v9))))

(:action op_3
:parameters (?v9 ?v1)
:precondition (and (pred_6 ?v9) (pred_2 ?v1) 
                  (pred_3 ?v9) (pred_4 ?v1 ?v9) (pred_12 ))
:effect (and (pred_10 ?v1)
   (not (pred_4 ?v1 ?v9)) (not (pred_12 ))))


(:action op_1
:parameters (?v9 ?v12 ?v2)
:precondition (and (pred_6 ?v9) (pred_2 ?v12) (pred_2 ?v2)
                  (pred_3 ?v9) (pred_10 ?v2) (pred_4 ?v12 ?v9))
:effect (and (pred_10 ?v12) (pred_4 ?v2 ?v9)
        (not (pred_10 ?v2)) (not (pred_4 ?v12 ?v9))))

(:action op_4
:parameters (?v9 ?v1)
:precondition (and (pred_6 ?v9) (pred_2 ?v1) 
                  (pred_3 ?v9) (pred_10 ?v1))
:effect (and (pred_12 ) (pred_4 ?v1 ?v9) (not (pred_10 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_07 obj_13 obj_04 obj_19 obj_06 obj_14 obj_05 obj_10 obj_12 obj_17 obj_20 obj_02 obj_08 obj_16 obj_15
    obj_09 obj_01
    obj_03 obj_18
    )

    (:init
       (pred_12)

       (pred_6 obj_11)
       (pred_6 obj_07)
       (pred_6 obj_13)
       (pred_6 obj_04)
       (pred_6 obj_19)
       (pred_6 obj_06)
       (pred_6 obj_14)
       (pred_6 obj_05)
       (pred_6 obj_10)
       (pred_6 obj_12)
       (pred_6 obj_17)
       (pred_6 obj_20)
       (pred_6 obj_02)
       (pred_6 obj_08)
       (pred_6 obj_16)
       (pred_6 obj_15)
       (pred_7 obj_09)
       (pred_7 obj_01)
       (pred_2 obj_03)
       (pred_2 obj_18)

       (pred_8 obj_11 obj_19)
       (pred_8 obj_11 obj_07)
       (pred_8 obj_07 obj_06)
       (pred_8 obj_07 obj_13)
       (pred_8 obj_07 obj_11)
       (pred_8 obj_13 obj_14)
       (pred_8 obj_13 obj_04)
       (pred_8 obj_13 obj_07)
       (pred_8 obj_04 obj_05)
       (pred_8 obj_04 obj_13)
       (pred_8 obj_19 obj_10)
       (pred_8 obj_19 obj_06)
       (pred_8 obj_19 obj_11)
       (pred_8 obj_06 obj_12)
       (pred_8 obj_06 obj_14)
       (pred_8 obj_06 obj_07)
       (pred_8 obj_06 obj_19)
       (pred_8 obj_14 obj_17)
       (pred_8 obj_14 obj_05)
       (pred_8 obj_14 obj_13)
       (pred_8 obj_14 obj_06)
       (pred_8 obj_05 obj_20)
       (pred_8 obj_05 obj_04)
       (pred_8 obj_05 obj_14)
       (pred_8 obj_10 obj_02)
       (pred_8 obj_10 obj_12)
       (pred_8 obj_10 obj_19)
       (pred_8 obj_12 obj_08)
       (pred_8 obj_12 obj_17)
       (pred_8 obj_12 obj_06)
       (pred_8 obj_12 obj_10)
       (pred_8 obj_17 obj_16)
       (pred_8 obj_17 obj_20)
       (pred_8 obj_17 obj_14)
       (pred_8 obj_17 obj_12)
       (pred_8 obj_20 obj_15)
       (pred_8 obj_20 obj_05)
       (pred_8 obj_20 obj_17)
       (pred_8 obj_02 obj_08)
       (pred_8 obj_02 obj_10)
       (pred_8 obj_08 obj_16)
       (pred_8 obj_08 obj_12)
       (pred_8 obj_08 obj_02)
       (pred_8 obj_16 obj_15)
       (pred_8 obj_16 obj_17)
       (pred_8 obj_16 obj_08)
       (pred_8 obj_15 obj_20)
       (pred_8 obj_15 obj_16)
       (pred_5 obj_16)
       (pred_5 obj_19)
       (pred_9  obj_16 obj_09)
       (pred_9  obj_19 obj_01)
       (pred_1 obj_11)
       (pred_1 obj_07)
       (pred_1 obj_13)
       (pred_1 obj_04)
       (pred_1 obj_06)
       (pred_1 obj_14)
       (pred_1 obj_05)
       (pred_1 obj_10)
       (pred_1 obj_12)
       (pred_1 obj_17)
       (pred_1 obj_20)
       (pred_1 obj_02)
       (pred_1 obj_08)
       (pred_1 obj_15)

       (pred_11  obj_03 obj_09)
       (pred_11  obj_18 obj_01)
       (pred_4 obj_03 obj_10)
       (pred_4 obj_18 obj_14)
       (pred_3 obj_20)
    )

    (:goal (and
       (pred_4 obj_03 obj_06)
    ))
(:constraints
  (always (not (pred_3 obj_17)))
)
)

; plan
1. (op_2 obj_20 obj_05)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_05)
   goals met: 0 of 1
2. (op_2 obj_05 obj_14)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_14)
   goals met: 0 of 1
3. (op_3 obj_14 obj_18)
   deleted: (pred_4 obj_18 obj_14) (pred_12)
   added: (pred_10 obj_18)
   goals met: 0 of 1
4. (op_2 obj_14 obj_06)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_06)
   goals met: 0 of 1
5. (op_4 obj_06 obj_18)
   deleted: (pred_10 obj_18)
   added: (pred_12) (pred_4 obj_18 obj_06)
   goals met: 0 of 1
6. (op_2 obj_06 obj_12)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_12)
   goals met: 0 of 1
7. (op_2 obj_12 obj_10)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_10)
   goals met: 0 of 1
8. (op_3 obj_10 obj_03)
   deleted: (pred_4 obj_03 obj_10) (pred_12)
   added: (pred_10 obj_03)
   goals met: 0 of 1
9. (op_2 obj_10 obj_12)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_12)
   goals met: 0 of 1
10. (op_2 obj_12 obj_06)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_06)
   goals met: 0 of 1
11. (op_1 obj_06 obj_18 obj_03)
   deleted: (pred_10 obj_03) (pred_4 obj_18 obj_06)
   added: (pred_10 obj_18) (pred_4 obj_03 obj_06)
   goals met: 1 of 1
